Full sphinx docs, updated CI
